{
  "_class_name": "UNet2DModel",
  "_diffusers_version": "0.16.1",
  "_name_or_path": "/dartfs-hpc/rc/home/5/f003xf5/.cache/huggingface/hub/models--google--ddpm-ema-church-256/snapshots/adb3310e276abf2c09ef3e2bb8b1946b47b1468d",
  "act_fn": "silu",
  "add_attention": true,
  "attention_head_dim": null,
  "block_out_channels": [
    128,
    128,
    256,
    256,
    512,
    512
  ],
  "center_input_sample": false,
  "class_embed_type": null,
  "down_block_types": [
    "DownBlock2D",
    "DownBlock2D",
    "DownBlock2D",
    "DownBlock2D",
    "AttnDownBlock2D",
    "DownBlock2D"
  ],
  "downsample_padding": 0,
  "flip_sin_to_cos": false,
  "freq_shift": 1,
  "in_channels": 3,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-06,
  "norm_num_groups": 32,
  "num_class_embeds": null,
  "out_channels": 3,
  "resnet_time_scale_shift": "default",
  "sample_size": 256,
  "time_embedding_type": "positional",
  "up_block_types": [
    "UpBlock2D",
    "AttnUpBlock2D",
    "UpBlock2D",
    "UpBlock2D",
    "UpBlock2D",
    "UpBlock2D"
  ]
}
